//=============================================================================
// コロニーHP処理 [ColonyHp.h]
//
// Author : HAL東京昼間部 2年制ゲーム学科 GP12A332 32 中込和輝
// 作成日 : 2019/6/1
//=============================================================================
//*****************************************************************************
// インクルード
//*****************************************************************************
#pragma once
#include "Main.h"
#include "Quad.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define COLONY_HP_SIZE_X		(150)				// コロニーHP横幅
#define COLONY_HP_SIZE_Y		(200)				// コロニーHP高さ


//*****************************************************************************
// クラス定義
//*****************************************************************************

class ColonyHp :public Quad {
private:
	LPDIRECT3DTEXTURE9		pTexture;				// テクスチャへのポインタ
	void release(void);								// テクスチャ解放

public:
	HRESULT init(int type);							// 初期化処理
	void uninit(void);								// 終了処理
	void update(void);								// 更新処理
	void draw(void);								// 描画処理

	// コンストラクタ・デストラクタ
	ColonyHp(void);
	ColonyHp(int sizeX, int sizeY, D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DCOLOR color);
	~ColonyHp(void);

	// アクセサ
	LPDIRECT3DTEXTURE9 ColonyHp::getTexture(void) { return pTexture; }		// テクスチャを取得
	LPDIRECT3DTEXTURE9* ColonyHp::getAdrTexture(void) { return &pTexture; }	// テクスチャへのポインタのアドレスを取得
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// コロニーHPを取得
ColonyHp *getColonyHp(void);