//=============================================================================
// クレジットの描画処理 [Credit2D.cpp]
// 制作者 飯塚春輝
////=============================================================================
#include "Credit2D.h"
//*****************************************************************************
// 定数
//*****************************************************************************
const static int		WIDTH = ((3840 / 2) - 16);					// クレジット2D横サイズ
const static int		HEIGHT = ((2160 / 2) - 9);					// クレジット2D縦サイズ
const static float		POSITION_X = ((WINDOW_WIDTH / 2) - 8.5f);	// クレジット2DX座標
const static float		POSITION_Y = ((WINDOW_HEIGHT / 2) - 10.0f);	// クレジット2DY座標
//*****************************************************************************
// グローバル変数
//*****************************************************************************
int Credit2D::cntUI = -1;
LPDIRECT3DTEXTURE9 Credit2D::textureCredit2D = NULL;				// クレジット2Dテクスチャ
//=============================================================================
// コンストラクタ
//=============================================================================
Credit2D::Credit2D()
{
	cntUI++;
}
//=============================================================================
// デストラクタ
//=============================================================================
Credit2D::~Credit2D()
{
}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT Credit2D::initialize(LPDIRECT3DDEVICE9 device, int _playerNumber, TextureLoader*textureLoader)
{
	// プレイヤーナンバー
	playerNumber = _playerNumber;

	// テクスチャを読み込む
	setVisualDirectory();

	textureCredit2D = *textureLoader->getTexture(textureLoaderNS::CREDIT);

	// クレジット2D初期化
	Sprite::initialize(device,
		textureCredit2D,							// テクスチャ
		spriteNS::CENTER,							// 原点
		WIDTH,										// 横幅
		HEIGHT,										// 高さ
		D3DXVECTOR3(POSITION_X, POSITION_Y, 0.0f),	// 座標
		D3DXVECTOR3(0.0f, 0.0f, 0.0f),				// 回転
		CREDIT2D_COLOR								// 色
	);

	return S_OK;
}
//=============================================================================
// 終了処理
//=============================================================================
void Credit2D::uninitialize(void)
{
}
//=============================================================================
// 更新処理
//=============================================================================
void Credit2D::update(void)
{
}
//=============================================================================
// 描画処理
//=============================================================================
void Credit2D::render(LPDIRECT3DDEVICE9 device)
{
	// クレジット2D描画
	Sprite::render(device);
}

