//===================================================================================================================================
//ÅyMagnet.cppÅz
// çÏê¨é“ÅFHALìåãûGP12A332 11 êõñÏ é˜
// çÏê¨ì˙ÅF2019/06/15
// çXêVì˙ÅF2019/08/04
//===================================================================================================================================
#include "Magnet.h"
using namespace magnetNS;
//===================================================================================================================================
//ÅyÉRÉìÉXÉgÉâÉNÉ^Åz
//===================================================================================================================================
Magnet::Magnet()
{
	activation();
}

//===================================================================================================================================
//ÅyÉfÉXÉgÉâÉNÉ^Åz
//===================================================================================================================================
Magnet::~Magnet()
{
}

//===================================================================================================================================
//Åyèâä˙âªÅz
//===================================================================================================================================
void Magnet::initialize(LPDIRECT3DDEVICE9 device, StaticMeshLoader* _staticMeshLoader,float _amount)
{
	amount = _amount;
	staticMeshLoader = _staticMeshLoader;
	int radius = 150;
	if (_amount > 0) {
		Object::initialize(device,  &staticMeshLoader->staticMesh[staticMeshNS::MAGNET_N],
			&D3DXVECTOR3((float)((rand() % radius) - radius / 2), (float)((rand() % radius) - radius / 2), (float)((rand() % radius) - radius / 2)));
	}
	else {
		Object::initialize(device, &staticMeshLoader->staticMesh[staticMeshNS::MAGNET_N],
			&D3DXVECTOR3((float)((rand() % radius) - radius / 2), (float)((rand() % radius) - radius / 2), (float)((rand() % radius) - radius / 2)));
	}
}

//===================================================================================================================================
//Åyé•óÕåvéZÅz
//===================================================================================================================================
void Magnet::calculationMagneticeForce(Magnet target)
{
	speed = D3DXVECTOR3(0, 0, 0);
	D3DXVECTOR3 moveDirection = target.position - position;
	float distance = D3DXVec3Length(&moveDirection);
	float magneticeForce = (target.amount*amount) / distance;
	D3DXVec3Normalize(&moveDirection,&moveDirection);
	speed += moveDirection * magneticeForce;
}

//===================================================================================================================================
//Åyé•ãCó îΩì]èàóùÅz
//===================================================================================================================================
void Magnet::reverseAmount()
{
	amount *= -1.0f;
}

//===================================================================================================================================
//ÅyçXêVÅz
//===================================================================================================================================
void Magnet::update()
{
	position += speed;
	Object::update();
}