//=============================================================================
// Poseの描画処理 [Pose.cpp]
// 制作者 飯塚春輝
////=============================================================================
#include "Pose.h"
//*****************************************************************************
// 定数
//*****************************************************************************
const static int		WIDTH = WINDOW_WIDTH;						// ポーズ横サイズ
const static int		HEIGHT = WINDOW_HEIGHT/4;					// ポーズ縦サイズ
const static float		POSITION_X = 0.0f;							// ポーズX座標
const static float		POSITION_Y = WINDOW_HEIGHT/2;				// ポーズY座標
//*****************************************************************************
// グローバル変数
//*****************************************************************************
int Pose::cntUI = -1;
LPDIRECT3DTEXTURE9 Pose::texturePose = NULL;						// ポーズテクスチャ
//=============================================================================
// コンストラクタ
//=============================================================================
Pose::Pose()
{
	cntUI++;
}
//=============================================================================
// デストラクタ
//=============================================================================
Pose::~Pose()
{
}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT Pose::initialize(LPDIRECT3DDEVICE9 device, int _playerNumber, TextureLoader*textureLoader)
{
	// プレイヤーナンバー
	playerNumber = _playerNumber;

	// テクスチャを読み込む
	setVisualDirectory();

	texturePose = *textureLoader->getTexture(textureLoaderNS::POSE);

	// ポーズ初期化
	Sprite::initialize(device,
		texturePose,								// テクスチャ
		spriteNS::TOP_LEFT,							// 原点
		WIDTH,										// 横幅
		HEIGHT,										// 高さ
		D3DXVECTOR3(POSITION_X, POSITION_Y, 0.0f),	// 座標
		D3DXVECTOR3(0.0f, 0.0f, 0.0f),				// 回転
		POSE_COLOR
	);

	poseon = false;									// ポーズしない

	return S_OK;
}
//=============================================================================
// 終了処理
//=============================================================================
void Pose::uninitialize(void)
{
	// ポーズ画像終了
	setTexture(NULL);

	// インスタンスが存在しなければテクスチャ解放
	cntUI--;
	if (cntUI < 0)
	{
		SAFE_RELEASE(texturePose)
	}
}
//=============================================================================
// 更新処理
//=============================================================================
void Pose::update(void)
{
}
//=============================================================================
// 描画処理
//=============================================================================
void Pose::render(LPDIRECT3DDEVICE9 device)
{
	// ポーズ描画
	Sprite::render(device);
}

