//=============================================================================
// リザルト描画処理 [Title2D.cpp]
// 制作者 飯塚春輝
////=============================================================================
#include "Result2D.h"
//*****************************************************************************
// 定数
//*****************************************************************************
const static int		WIDTH = WINDOW_WIDTH;				// リザルト2D横サイズ
const static int		HEIGHT = WINDOW_HEIGHT;				// リザルト2D縦サイズ
const static float		POSITION_X_PLAYER1 = 0.0f;			// リザルト2DX座標
const static float		POSITION_Y = 0.0f;					// リザルト2DY座標
//*****************************************************************************
// グローバル変数
//*****************************************************************************
int Result2D::cntUI = -1;
LPDIRECT3DTEXTURE9 Result2D::result2DTexture = NULL;		// リザルト2Dテクスチャ
//=============================================================================
// コンストラクタ
//=============================================================================
Result2D::Result2D()
{
	cntUI++;
}
//=============================================================================
// デストラクタ
//=============================================================================
Result2D::~Result2D()
{
}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT Result2D::initialize(LPDIRECT3DDEVICE9 device, int _playerNumber, TextureLoader*textureLoader)
{
	// プレイヤーナンバー
	playerNumber = _playerNumber;

	// テクスチャを読み込む
	setVisualDirectory();

	result2DTexture = *textureLoader->getTexture(textureLoaderNS::RESULT);

	// リザルト2D初期化
	Sprite::initialize(device,
		result2DTexture,					// テクスチャ
		spriteNS::TOP_LEFT,					// 原点
		WIDTH,								// 横幅
		HEIGHT,								// 高さ
		D3DXVECTOR3(POSITION_X_PLAYER1, POSITION_Y, 0.0f),// 座標
		D3DXVECTOR3(0.0f, 0.0f, 0.0f),		// 回転
		RESULT2D_COLOR						// 色
	);

	return S_OK;
}
//=============================================================================
// 終了処理
//=============================================================================
void Result2D::uninitialize(void)
{
	// リザルト2D画像解放
	setTexture(NULL);

	// インスタンスが存在しなければテクスチャ解放
	cntUI--;
	if (cntUI < 0)
	{
		SAFE_RELEASE(result2DTexture)
	}
}
//=============================================================================
// 更新処理
//=============================================================================
void Result2D::update(void)
{
}
//=============================================================================
// 描画処理
//=============================================================================
void Result2D::render(LPDIRECT3DDEVICE9 device)
{
	// リザルト2D描画
	Sprite::render(device);
}