//============================================================================================================================================
// Document
//============================================================================================================================================
// UIPause.h
// HAL東京 GP-12A-332 09 亀岡竣介
// 2019/08/27
//============================================================================================================================================
#pragma once
#include "Sprite.h"
#include "AbstractScene.h"
//============================================================================================================================================
// NameSpace
// 名前空間
//============================================================================================================================================
namespace uiPauseNS
{
	const int WIDTH = (1938);						//	ポーズ横サイズ
	const int HEIGHT = (198);						//	ポーズ縦サイズ
	const float POSITION_X = (WINDOW_WIDTH / 2);	//	ポーズX座標
	const float POSITION_Y = (WINDOW_HEIGHT / 2);	//	ポーズY座標
}
//============================================================================================================================================
// Class
// クラス
//============================================================================================================================================
class UIPause
{
private:
	static int instanceIndex;			//	インスタンスインデックス
	static LPDIRECT3DTEXTURE9 texture;	//	テクスチャ
	Sprite sprite;						//	スプライト
	bool renderFlag;					//	描画フラグ
public:
	UIPause(void);
	~UIPause(void);
	HRESULT initialize(LPDIRECT3DDEVICE9 _device, TextureLoader* _textureLoader);
	void release(void);
	void update(void);
	void render(LPDIRECT3DDEVICE9 _device);
	void setRenderFlag(bool _flag);
	bool getRenderFlag(void);
};